{
  "<gen1ou>": 0,
  "<player>": 1,
  "<opponent>": 2,
  "<move>": 3,
  "<switch>": 4,
  "<moveset>": 5,
  "<conditions>": 6,
  "<player_prev>": 7,
  "<opp_prev>": 8,
  "<anychoice>": 9,
  "<forcedswitch>": 10,
  "<blank>": 11,
  "nostatus": 12,
  "par": 13,
  "brn": 14,
  "slp": 15,
  "frz": 16,
  "psn": 17,
  "tox": 18,
  "fnt": 19,
  "noweather": 20,
  "noeffect": 21,
  "confusion": 22,
  "leechseed": 23,
  "substitute": 24,
  "partiallytrapped": 25,
  "lightscreen": 26,
  "reflect": 27,
  "noconditions": 28,
  "normal": 29,
  "fire": 30,
  "water": 31,
  "electric": 32,
  "grass": 33,
  "ice": 34,
  "fighting": 35,
  "poison": 36,
  "ground": 37,
  "flying": 38,
  "psychic": 39,
  "bug": 40,
  "rock": 41,
  "ghost": 42,
  "dragon": 43,
  "notype": 44,
  "???": 45,
  "physical": 46,
  "special": 47,
  "status": 48,
  "nomove": 49,
  "recharge": 50,
  "abra": 51,
  "aerodactyl": 52,
  "aerodactylmega": 53,
  "alakazam": 54,
  "alakazammega": 55,
  "arbok": 56,
  "arcanine": 57,
  "arcaninehisui": 58,
  "articuno": 59,
  "articunogalar": 60,
  "beedrill": 61,
  "beedrillmega": 62,
  "bellsprout": 63,
  "blastoise": 64,
  "blastoisegmax": 65,
  "blastoisemega": 66,
  "bulbasaur": 67,
  "butterfree": 68,
  "butterfreegmax": 69,
  "caterpie": 70,
  "chansey": 71,
  "charizard": 72,
  "charizardgmax": 73,
  "charizardmegax": 74,
  "charizardmegay": 75,
  "charmander": 76,
  "charmeleon": 77,
  "clefable": 78,
  "clefairy": 79,
  "cloyster": 80,
  "cubone": 81,
  "dewgong": 82,
  "diglett": 83,
  "diglettalola": 84,
  "ditto": 85,
  "dodrio": 86,
  "doduo": 87,
  "dragonair": 88,
  "dragonite": 89,
  "dratini": 90,
  "drowzee": 91,
  "dugtrio": 92,
  "dugtrioalola": 93,
  "eevee": 94,
  "eeveegmax": 95,
  "eeveestarter": 96,
  "ekans": 97,
  "electabuzz": 98,
  "electrode": 99,
  "electrodehisui": 100,
  "exeggcute": 101,
  "exeggutor": 102,
  "exeggutoralola": 103,
  "farfetchd": 104,
  "farfetchdgalar": 105,
  "fearow": 106,
  "flareon": 107,
  "gastly": 108,
  "gengar": 109,
  "gengargmax": 110,
  "gengarmega": 111,
  "geodude": 112,
  "geodudealola": 113,
  "gloom": 114,
  "golbat": 115,
  "goldeen": 116,
  "golduck": 117,
  "golem": 118,
  "golemalola": 119,
  "graveler": 120,
  "graveleralola": 121,
  "grimer": 122,
  "grimeralola": 123,
  "growlithe": 124,
  "growlithehisui": 125,
  "gyarados": 126,
  "gyaradosmega": 127,
  "haunter": 128,
  "hitmonchan": 129,
  "hitmonlee": 130,
  "horsea": 131,
  "hypno": 132,
  "ivysaur": 133,
  "jigglypuff": 134,
  "jolteon": 135,
  "jynx": 136,
  "kabuto": 137,
  "kabutops": 138,
  "kadabra": 139,
  "kakuna": 140,
  "kangaskhan": 141,
  "kangaskhanmega": 142,
  "kingler": 143,
  "kinglergmax": 144,
  "koffing": 145,
  "krabby": 146,
  "lapras": 147,
  "laprasgmax": 148,
  "lickitung": 149,
  "machamp": 150,
  "machampgmax": 151,
  "machoke": 152,
  "machop": 153,
  "magikarp": 154,
  "magmar": 155,
  "magnemite": 156,
  "magneton": 157,
  "mankey": 158,
  "marowak": 159,
  "marowakalola": 160,
  "marowakalolatotem": 161,
  "meowth": 162,
  "meowthalola": 163,
  "meowthgalar": 164,
  "meowthgmax": 165,
  "metapod": 166,
  "mew": 167,
  "mewtwo": 168,
  "mewtwomegax": 169,
  "mewtwomegay": 170,
  "moltres": 171,
  "moltresgalar": 172,
  "mrmime": 173,
  "mrmimegalar": 174,
  "muk": 175,
  "mukalola": 176,
  "nidoking": 177,
  "nidoqueen": 178,
  "nidoranf": 179,
  "nidoranm": 180,
  "nidorina": 181,
  "nidorino": 182,
  "ninetales": 183,
  "ninetalesalola": 184,
  "oddish": 185,
  "omanyte": 186,
  "omastar": 187,
  "onix": 188,
  "paras": 189,
  "parasect": 190,
  "persian": 191,
  "persianalola": 192,
  "pidgeot": 193,
  "pidgeotmega": 194,
  "pidgeotto": 195,
  "pidgey": 196,
  "pikachu": 197,
  "pikachualola": 198,
  "pikachualolagmax": 199,
  "pikachubelle": 200,
  "pikachubellegmax": 201,
  "pikachucosplay": 202,
  "pikachucosplaygmax": 203,
  "pikachugmax": 204,
  "pikachuhoenn": 205,
  "pikachuhoenngmax": 206,
  "pikachukalos": 207,
  "pikachukalosgmax": 208,
  "pikachulibre": 209,
  "pikachulibregmax": 210,
  "pikachuoriginal": 211,
  "pikachuoriginalgmax": 212,
  "pikachupartner": 213,
  "pikachupartnergmax": 214,
  "pikachuphd": 215,
  "pikachuphdgmax": 216,
  "pikachupopstar": 217,
  "pikachupopstargmax": 218,
  "pikachurockstar": 219,
  "pikachurockstargmax": 220,
  "pikachusinnoh": 221,
  "pikachusinnohgmax": 222,
  "pikachustarter": 223,
  "pikachustartergmax": 224,
  "pikachuunova": 225,
  "pikachuunovagmax": 226,
  "pikachuworld": 227,
  "pikachuworldgmax": 228,
  "pinsir": 229,
  "pinsirmega": 230,
  "poliwag": 231,
  "poliwhirl": 232,
  "poliwrath": 233,
  "ponyta": 234,
  "ponytagalar": 235,
  "porygon": 236,
  "primeape": 237,
  "psyduck": 238,
  "raichu": 239,
  "raichualola": 240,
  "rapidash": 241,
  "rapidashgalar": 242,
  "raticate": 243,
  "raticatealola": 244,
  "raticatealolatotem": 245,
  "rattata": 246,
  "rattataalola": 247,
  "rhydon": 248,
  "rhyhorn": 249,
  "sandshrew": 250,
  "sandshrewalola": 251,
  "sandslash": 252,
  "sandslashalola": 253,
  "scyther": 254,
  "seadra": 255,
  "seaking": 256,
  "seel": 257,
  "shellder": 258,
  "slowbro": 259,
  "slowbrogalar": 260,
  "slowbromega": 261,
  "slowpoke": 262,
  "slowpokegalar": 263,
  "snorlax": 264,
  "snorlaxgmax": 265,
  "spearow": 266,
  "squirtle": 267,
  "starmie": 268,
  "staryu": 269,
  "tangela": 270,
  "tauros": 271,
  "taurospaldeaaqua": 272,
  "taurospaldeablaze": 273,
  "taurospaldeacombat": 274,
  "tentacool": 275,
  "tentacruel": 276,
  "vaporeon": 277,
  "venomoth": 278,
  "venonat": 279,
  "venusaur": 280,
  "venusaurgmax": 281,
  "venusaurmega": 282,
  "victreebel": 283,
  "vileplume": 284,
  "voltorb": 285,
  "voltorbhisui": 286,
  "vulpix": 287,
  "vulpixalola": 288,
  "wartortle": 289,
  "weedle": 290,
  "weepinbell": 291,
  "weezing": 292,
  "weezinggalar": 293,
  "wigglytuff": 294,
  "zapdos": 295,
  "zapdosgalar": 296,
  "zubat": 297,
  "absorb": 298,
  "acid": 299,
  "acidarmor": 300,
  "agility": 301,
  "amnesia": 302,
  "aurorabeam": 303,
  "barrage": 304,
  "barrier": 305,
  "bide": 306,
  "bind": 307,
  "bite": 308,
  "blizzard": 309,
  "bodyslam": 310,
  "boneclub": 311,
  "bonemerang": 312,
  "bubble": 313,
  "bubblebeam": 314,
  "clamp": 315,
  "cometpunch": 316,
  "confuseray": 317,
  "constrict": 318,
  "conversion": 319,
  "counter": 320,
  "crabhammer": 321,
  "cut": 322,
  "defensecurl": 323,
  "dig": 324,
  "disable": 325,
  "dizzypunch": 326,
  "doubleedge": 327,
  "doublekick": 328,
  "doubleslap": 329,
  "doubleteam": 330,
  "dragonrage": 331,
  "dreameater": 332,
  "drillpeck": 333,
  "earthquake": 334,
  "eggbomb": 335,
  "ember": 336,
  "explosion": 337,
  "fireblast": 338,
  "firepunch": 339,
  "firespin": 340,
  "fissure": 341,
  "flamethrower": 342,
  "flash": 343,
  "fly": 344,
  "focusenergy": 345,
  "furyattack": 346,
  "furyswipes": 347,
  "glare": 348,
  "growl": 349,
  "growth": 350,
  "guillotine": 351,
  "gust": 352,
  "harden": 353,
  "haze": 354,
  "headbutt": 355,
  "highjumpkick": 356,
  "hornattack": 357,
  "horndrill": 358,
  "hydropump": 359,
  "hyperbeam": 360,
  "hyperfang": 361,
  "hypnosis": 362,
  "icebeam": 363,
  "icepunch": 364,
  "jumpkick": 365,
  "karatechop": 366,
  "kinesis": 367,
  "leechlife": 368,
  "leer": 369,
  "lick": 370,
  "lovelykiss": 371,
  "lowkick": 372,
  "meditate": 373,
  "megadrain": 374,
  "megakick": 375,
  "megapunch": 376,
  "metronome": 377,
  "mimic": 378,
  "minimize": 379,
  "mirrormove": 380,
  "mist": 381,
  "nightshade": 382,
  "paleowave": 383,
  "payday": 384,
  "peck": 385,
  "petaldance": 386,
  "pinmissile": 387,
  "poisongas": 388,
  "poisonpowder": 389,
  "poisonsting": 390,
  "pound": 391,
  "psybeam": 392,
  "psywave": 393,
  "quickattack": 394,
  "rage": 395,
  "razorleaf": 396,
  "razorwind": 397,
  "recover": 398,
  "rest": 399,
  "roar": 400,
  "rockslide": 401,
  "rockthrow": 402,
  "rollingkick": 403,
  "sandattack": 404,
  "scratch": 405,
  "screech": 406,
  "seismictoss": 407,
  "selfdestruct": 408,
  "shadowstrike": 409,
  "sharpen": 410,
  "sing": 411,
  "skullbash": 412,
  "skyattack": 413,
  "slam": 414,
  "slash": 415,
  "sleeppowder": 416,
  "sludge": 417,
  "smog": 418,
  "smokescreen": 419,
  "softboiled": 420,
  "solarbeam": 421,
  "sonicboom": 422,
  "spikecannon": 423,
  "splash": 424,
  "spore": 425,
  "stomp": 426,
  "strength": 427,
  "stringshot": 428,
  "struggle": 429,
  "stunspore": 430,
  "submission": 431,
  "superfang": 432,
  "supersonic": 433,
  "surf": 434,
  "swift": 435,
  "swordsdance": 436,
  "tackle": 437,
  "tailwhip": 438,
  "takedown": 439,
  "teleport": 440,
  "thrash": 441,
  "thunder": 442,
  "thunderbolt": 443,
  "thunderpunch": 444,
  "thundershock": 445,
  "thunderwave": 446,
  "toxic": 447,
  "transform": 448,
  "triattack": 449,
  "twineedle": 450,
  "vinewhip": 451,
  "visegrip": 452,
  "waterfall": 453,
  "watergun": 454,
  "whirlwind": 455,
  "wingattack": 456,
  "withdraw": 457,
  "wrap": 458,
  "<bench_status>": 459
}